DataProcessors/ирВыгрузкаЗагрузкаДанныхЧерезФайл.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<DataProcessor>
		<Properties>
			<Name>ирВыгрузкаЗагрузкаДанныхЧерезФайл</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыгружатьДвиженияВместеСДокументами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьXDTO</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПропускатьОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УзелВыборкиДанных</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УзелОтправитель</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатОбработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>XML</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Таблица</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ирВыгрузкаЗагрузкаДанныхЧерезФайл/Ext/ObjectModule.bsl
//ирМобильный Перем ирМобильный Экспорт;
//ирМобильный Перем ирОбщий Экспорт;
//ирМобильный Перем ирСервер Экспорт;
//ирМобильный Перем ирКэш Экспорт;
//ирМобильный Перем ирПривилегированный Экспорт;

//ирМобильный #Если Клиент Тогда
//ирМобильный Контейнер = Новый Структура();
//ирМобильный Оповестить("ирПолучитьБазовуюФорму", Контейнер);
//ирМобильный Если Не Контейнер.Свойство("ирМобильный", ирМобильный) Тогда
//ирМобильный 	ПолноеИмяФайлаБазовогоМодуля = ВосстановитьЗначение("ирПолноеИмяФайлаОсновногоМодуля");
//ирМобильный 	ирМобильный = ВнешниеОбработки.ПолучитьФорму(ПолноеИмяФайлаБазовогоМодуля);
//ирМобильный КонецЕсли; 
//ирМобильный ирОбщий = ирМобильный.ПолучитьОбщийМодульЛкс("ирОбщий");
//ирМобильный ирКэш = ирМобильный.ПолучитьОбщийМодульЛкс("ирКэш");
//ирМобильный ирСервер = ирМобильный.ПолучитьОбщийМодульЛкс("ирСервер");
//ирМобильный ирПривилегированный = ирМобильный.ПолучитьОбщийМодульЛкс("ирПривилегированный");
//ирМобильный #КонецЕсли

Перем мПоследнийПрочитанныйОбъект Экспорт;

Процедура ОбработатьИсключениеПоОбъекту(ОбъектБД, ОписаниеОшибки, ВывестиСообщение = Истина) Экспорт 
	
	СтрокаРезультата = РезультатОбработки.Добавить();
	СтрокаРезультата.Порядок = СтрокаРезультата.НомерСтроки;
	СтрокаРезультата.ОписаниеОшибки = ОписаниеОшибки;
	СтрокаРезультата.XML = ирОбщий.СохранитьОбъектВВидеСтрокиXMLЛкс(ОбъектБД, Ложь);
	СтрокаРезультата.КлючОбъекта = ирОбщий.ПолучитьXMLКлючОбъектаБДЛкс(ОбъектБД, Истина);
	Если ТипЗнч(ОбъектБД) = Тип("УдалениеОбъекта") Тогда
		СтрокаРезультата.Таблица = ОбъектБД.Ссылка.Метаданные().ПолноеИмя();
	Иначе
		СтрокаРезультата.Таблица = ОбъектБД.Метаданные().ПолноеИмя();
	КонецЕсли; 
	Если ВывестиСообщение Тогда
		Сообщить("Ошибка обработки объекта """ + СтрокаРезультата.КлючОбъекта + """: " + ОписаниеОшибки, СтатусСообщения.Внимание);
	КонецЕсли; 
	
КонецПроцедуры

Функция ВыполнитьВыгрузку() Экспорт 

	РезультатОбработки.Очистить();
	ПараметрыОбработки = Новый Структура;
	ПередВыгрузкойВсех(ПараметрыОбработки);
	//ИмяВременногоКаталога = ПолучитьИмяВременногоФайла();
	//СоздатьКаталог(ИмяВременногоКаталога);
	//ФайлДанных = Новый файл(ИмяВременногоКаталога + "\Data.xml");
	//ЗаписьXML = Новый ЗаписьXML;
	//ЗаписьXML.ОткрытьФайл(ФайлДанных.ПолноеИмя);
	//ЗаписьXML.ЗаписатьНачалоЭлемента("IRData");
	//СчетчикВыгруженныхОбъектов = 0;
	КоличествоОбъектов = ирОбщий.ПолучитьКоличествоИзмененийПоУзлуЛкс(УзелВыборкиДанных);
	Индикатор = ирОбщий.ПолучитьИндикаторПроцессаЛкс(КоличествоОбъектов, "Выборка");
	ВыборкаОбъектов = ПланыОбмена.ВыбратьИзменения(УзелВыборкиДанных, УзелВыборкиДанных.НомерОтправленного + 1);
	Пока ВыборкаОбъектов.Следующий() Цикл
		ирОбщий.ОбработатьИндикаторЛкс(Индикатор);
		ОбъектБД = ВыборкаОбъектов.Получить();
		ВыгрузитьОбъектБД(ПараметрыОбработки.ЗаписьXML, ОбъектБД, ПараметрыОбработки.СчетчикВыгруженныхОбъектов);
		Если ВыгружатьДвиженияВместеСДокументами Тогда
			ОбъектМД = ОбъектБД.Метаданные();
			Если ирОбщий.ЛиКорневойТипДокументаЛкс(ирОбщий.ПолучитьПервыйФрагментЛкс(ОбъектМД.ПолноеИмя())) Тогда
				ОбъектыМД = ирОбщий.ПолучитьМетаданныеНаборовЗаписейПоРегистраторуЛкс(ОбъектМД);
				Для Каждого МетаРегистр из ОбъектыМД Цикл
					ПолноеИмяМД = МетаРегистр.ПолноеИмя();
					НаборЗаписей = Новый (СтрЗаменить(ПолноеИмяМД, ".", "НаборЗаписей."));
					НаборЗаписей.Отбор.Регистратор.Установить(ОбъектБД.Ссылка);
					ВыгрузитьОбъектБД(ПараметрыОбработки.ЗаписьXML, НаборЗаписей, ПараметрыОбработки.СчетчикВыгруженныхОбъектов);
				КонецЦикла;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла; 
	ирОбщий.ОсвободитьИндикаторПроцессаЛкс(, Истина);
	//ИнфоДанных = Новый Структура;
	//ИнфоДанных.Вставить("КоличествоОбъектов", СчетчикВыгруженныхОбъектов);
	//ИнфоДанных.Вставить("ИспользоватьXDTO", ИспользоватьXDTO);
	//Сообщить("Выгружено объектов " + XMLСтрока(СчетчикВыгруженныхОбъектов));
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	//ЗаписьXML.Закрыть();
	//ФайлИнфо = Новый файл(ИмяВременногоКаталога + "\Info.xml");
	//ЗаписьXML = Новый ЗаписьXML;
	//ЗаписьXML.ОткрытьФайл(ФайлИнфо.ПолноеИмя);
	//СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ИнфоДанных);
	//ЗаписьXML.Закрыть();
	//ЗаписьZIP = Новый ЗаписьZipФайла(ИмяФайла);
	//ЗаписьZIP.Добавить(ФайлДанных.ПолноеИмя);
	//ЗаписьZIP.Добавить(ФайлИнфо.ПолноеИмя);
	//ЗаписьZIP.Записать();
	//УдалитьФайлы(ИмяВременногоКаталога);
	ПослеВыгрузкиВсех(ПараметрыОбработки);
	Возврат Истина;

КонецФункции

Процедура ВыгрузитьОбъектБД(Знач ЗаписьXML, Знач ОбъектБД, СчетчикВыгруженныхОбъектов)
	
	Попытка
		Успех = Истина;
        Если ИспользоватьXDTO Тогда
            СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ОбъектБД);
        Иначе 
            ЗаписатьXML(ЗаписьXML, ОбъектБД);
        КонецЕсли; 
	Исключение
		Успех = Ложь;
        ОбработатьИсключениеПоОбъекту(ОбъектБД, ОписаниеОшибки());
        Если Не ПропускатьОшибки Тогда
            ВызватьИсключение;
        КонецЕсли; 
	КонецПопытки;
	Если Успех Тогда
		СчетчикВыгруженныхОбъектов = СчетчикВыгруженныхОбъектов + 1;
	КонецЕсли; 

КонецПроцедуры // ВыполнитьВыгрузку()

Функция ВыполнитьЗагрузку() Экспорт 

	РезультатОбработки.Очистить();
	ИмяВременногоКаталога = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременногоКаталога);
	ЧтениеZip = Новый ЧтениеZipФайла(ИмяФайла);
	ЧтениеZip.ИзвлечьВсе(ИмяВременногоКаталога);
	ФайлИнфо = Новый файл(ИмяВременногоКаталога + "\Info.xml");
	Если Не ФайлИнфо.Существует() Тогда
		Возврат "Неверный формат файла данных!";
	КонецЕсли; 
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ФайлИнфо.ПолноеИмя);
	ИнфоДанных = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	ФайлДанных = Новый файл(ИмяВременногоКаталога + "\Data.xml");
	Если Не ФайлИнфо.Существует() Тогда
		Возврат "Неверный формат файла данных!";
	КонецЕсли; 
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ФайлДанных.ПолноеИмя);
	ЧтениеXML.Прочитать();
	Если ЧтениеXML.ЛокальноеИмя <> "IRData" Тогда
		ЧтениеXML.Закрыть();
		УдалитьФайлы(ИмяВременногоКаталога);
		Возврат "Неверный формат файла данных!";
	КонецЕсли; 
	ЧтениеXML.Прочитать();
	Индикатор = ирОбщий.ПолучитьИндикаторПроцессаЛкс(ИнфоДанных.КоличествоОбъектов, "Загрузка");
	СчетчикСчитанныхОбъектов = 0;
	Пока Истина Цикл
		ирОбщий.ОбработатьИндикаторЛкс(Индикатор);
		Если ИнфоДанных.ИспользоватьXDTO Тогда
			Если Не СериализаторXDTO.ВозможностьЧтенияXML(ЧтениеXML) Тогда
				Прервать;
			КонецЕсли; 
			ОбъектБД = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
		Иначе 
			Если Не ВозможностьЧтенияXML(ЧтениеXML) Тогда
				Прервать;
			КонецЕсли; 
			ОбъектБД = ПрочитатьXML(ЧтениеXML);
		КонецЕсли;
		СчетчикСчитанныхОбъектов = СчетчикСчитанныхОбъектов + 1;
		#Если _ Тогда
			ОбъектБД = Справочники.ирАлгоритмы.СоздатьЭлемент();
		#КонецЕсли
		ОбъектБД.ОбменДанными.Загрузка = Истина;
		ОбъектБД.ОбменДанными.Отправитель = УзелОтправитель;
		ЭтотОбъект.мПоследнийПрочитанныйОбъект = ОбъектБД;
		Попытка
			ирОбщий.ЗаписатьОбъектЛкс(ОбъектБД, ЗаписьНаСервере);
			Успех = Истина;
		Исключение
			Успех = Ложь;
			ОбработатьИсключениеПоОбъекту(ОбъектБД, ОписаниеОшибки());
			Если Не ПропускатьОшибки Тогда
				ВызватьИсключение;
			КонецЕсли; 
		КонецПопытки; 
		ВызватьИсключение 1;
	КонецЦикла;
	ЧтениеXML.Закрыть();
	ирОбщий.ОсвободитьИндикаторПроцессаЛкс(, Истина);
	УдалитьФайлы(ИмяВременногоКаталога);
	ЭтотОбъект.мПоследнийПрочитанныйОбъект = Неопределено;
	Если СчетчикСчитанныхОбъектов <> ИнфоДанных.КоличествоОбъектов Тогда
		Возврат "Считано объектов " + XMLСтрока(СчетчикСчитанныхОбъектов) + " из " + XMLСтрока(ИнфоДанных.КоличествоОбъектов) + " заявленных!";
	КонецЕсли; 
	Возврат Истина;

КонецФункции // ВыполнитьВыгрузку()

Процедура ПередВыгрузкойВсех(Параметры) Экспорт 

	#Если _ Тогда
	    Параметры = Новый Структура;
	#КонецЕсли
	ИмяВременногоКаталога = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременногоКаталога);
	ФайлДанных = Новый файл(ИмяВременногоКаталога + "\Data.xml");
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ФайлДанных.ПолноеИмя);
	ЗаписьXML.ЗаписатьНачалоЭлемента("IRData");
	СчетчикВыгруженныхОбъектов = 0;
	Параметры.Вставить("ЗаписьXML", ЗаписьXML);
	Параметры.Вставить("ФайлДанных", ФайлДанных);
	Параметры.Вставить("ИмяВременногоКаталога", ИмяВременногоКаталога);
	Параметры.Вставить("СчетчикВыгруженныхОбъектов", СчетчикВыгруженныхОбъектов);

КонецПроцедуры // ПередГрупповойОбработкой() 

Процедура ПослеВыгрузкиВсех(Параметры) Экспорт 

	#Если _ Тогда
	    Параметры = Новый Структура;
	#КонецЕсли
	ИнфоДанных = Новый Структура;
	ИнфоДанных.Вставить("КоличествоОбъектов", Параметры.СчетчикВыгруженныхОбъектов);
	ИнфоДанных.Вставить("ИспользоватьXDTO", ИспользоватьXDTO);
	Сообщить("Выгружено объектов " + XMLСтрока(Параметры.СчетчикВыгруженныхОбъектов));
	Параметры.ЗаписьXML.ЗаписатьКонецЭлемента();
	Параметры.ЗаписьXML.Закрыть();
	ФайлИнфо = Новый файл(Параметры.ИмяВременногоКаталога + "\Info.xml");
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ФайлИнфо.ПолноеИмя);
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ИнфоДанных);
	ЗаписьXML.Закрыть();
	ЗаписьZIP = Новый ЗаписьZipФайла(ИмяФайла);
	ЗаписьZIP.Добавить(Параметры.ФайлДанных.ПолноеИмя);
	ЗаписьZIP.Добавить(ФайлИнфо.ПолноеИмя);
	ЗаписьZIP.Записать();
	УдалитьФайлы(Параметры.ИмяВременногоКаталога);

КонецПроцедуры // ПередГрупповойОбработкой()
